import 'package:HamilGuide/utils/weeks_manager.dart';
import 'package:flutter/material.dart';

const String testDevice = 'MobileId';

class Weeks extends StatefulWidget {
  @override
  _WeeksState createState() => _WeeksState();
}

class _WeeksState extends State<Weeks> {
  @override
  void initState() {
    super.initState();
  }

  @override
  Widget build(BuildContext context) {
    return Directionality(
      textDirection: TextDirection.rtl,
      child: SingleChildScrollView(
        child: Column(
          textDirection: TextDirection.rtl,
          children: <Widget>[
            Container(
              color: Colors.pink,
              child: Row(
                mainAxisAlignment: MainAxisAlignment.spaceBetween,
                children: <Widget>[
                  RaisedButton(
                    color: Colors.transparent.withOpacity(.1),
                    child: Icon(Icons.arrow_back_ios),
                    onPressed: () {
                      CurrentPageManager.pageNumber != 40
                          ? CurrentPageManager.pageNumber++
                          // ignore: unnecessary_statements

                          // ignore: unnecessary_statements
                          : () {};
                    },
                  ),
                  Text(
                    "الأسبوع " + CurrentPageManager.pageNumber.toString(),
                    style: TextStyle(fontSize: 15.0),
                  ),
                  RaisedButton(
                    color: Colors.transparent.withOpacity(.1),
                    child: Icon(Icons.arrow_forward_ios),
                    onPressed: () {
                      CurrentPageManager.pageNumber > 1
                          ? CurrentPageManager.pageNumber--
                          // ignore: unnecessary_statements
                          : () {};
                    },
                  ),
                ],
              ),
            ),
            Row(
              children: <Widget>[
                Container(
                  color: Colors.pink.withOpacity(.5),
                  height: 50,
                  width: MediaQuery.of(context).size.width,
                  child: Row(
                    mainAxisAlignment: MainAxisAlignment.center,
                    children: <Widget>[
                      Icon(
                        Icons.person,
                        color: Colors.white,
                      ),
                      SizedBox(
                        width: 20,
                      ),
                      Text(
                        "جسمك ",
                        style: TextStyle(color: Colors.white, fontSize: 15),
                      )
                    ],
                  ),
                )
              ],
            ),
            Container(
              color: Colors.amber.withOpacity(.4),
              height: 50,
              width: MediaQuery.of(context).size.width,
              child: Padding(
                padding: const EdgeInsets.all(8.0),
                child: Center(
                    child: Text(
                  myTexts[CurrentPageManager.pageNumber].name,
                  style: TextStyle(
                      fontWeight: FontWeight.bold,
                      fontSize: 15,
                      color: Colors.pink),
                )),
              ),
            ),
            Container(
              color: Colors.amber.withOpacity(.4),
              height: 200,
              width: MediaQuery.of(context).size.width,
              child: Padding(
                padding: const EdgeInsets.all(8.0),
                child: ListView(
//                  shrinkWrap: true,
                    primary: false,
                    children: <Widget>[
                      Text(
                        mymodels[CurrentPageManager.pageNumber].content,
                        style: TextStyle(fontSize: 15.0),
                      )
                    ]),
              ),
            ),
            Row(
              children: <Widget>[
                Container(
                  color: Colors.pink.withOpacity(.5),
                  height: 50,
                  width: MediaQuery.of(context).size.width,
                  child: Row(
                    mainAxisAlignment: MainAxisAlignment.center,
                    children: <Widget>[
                      Icon(
                        Icons.person,
                        color: Colors.white,
                      ),
                      SizedBox(
                        width: 20,
                      ),
                      Text(
                        "طفلك  ",
                        style: TextStyle(color: Colors.white, fontSize: 15),
                      )
                    ],
                  ),
                )
              ],
            ),
            Container(
              color: Colors.amber.withOpacity(.4),
              height: 200,
              width: MediaQuery.of(context).size.width,
              child: Padding(
                padding: const EdgeInsets.all(8.0),
                child: ListView(primary: false, children: <Widget>[
                  Text(
                    myBabies[CurrentPageManager.pageNumber].description,
                    style: TextStyle(fontSize: 15.0),
                  ),
                ]),
              ),
            ),
          ],
        ),
      ),
    );
  }
}

//class

class MyBaby {
  String description;

  MyBaby({this.description});
}

List myBabies = [
  MyBaby(description: "hhhhhhh"),
  MyBaby(
      description: "	يكون عمر البويضة خمسة أيام تقريبًا. 	"
          "يمكن أن تتبعي برنامج غذائي صحي ومفيد، كما يمكنك تناول كمية من حمض الفوليك بشكل يومي من أجل الوقاية من التعرض لحالة العمود الفقري المشروم، والجدير بالذكر أن تناول 400 ميللجرام من حمض الفوليك يكون جيدًا."),
  MyBaby(
      description:
          "خلال هذه الفترة يتسأل الكثيرون عن جنس الجنين وهل يمكن تحديده؟ حيث يعتقد البعض أن تناول منتجات الالبان والنشويات بكثرة يساعد في تكوين جنس الجنين لتكون بنتا، بينما تناول اللحوم والفواكة يجعل الجنين ولدا، ولكن ما تم اثباته من قبل الباحثون أن تخصيب البويضة قبل مرور وقت طويل من إطلاقها يجعل احتمالية أن يكون الجنس ذكرا أكبر من كونها أنثى"),
  MyBaby(
      description:
          "في هذه الفترة يكون طفلك حجم بذرة الخشخاش، بعد دخول النطفة المنوية إلى البويضة تحدث تغيرات على سطح البويضةِ من أجل منع أي نطفة منوية من الدخول إلى البويضة. تلتصق المادة التناسلية الموجودة في البويضة مع المادة التناسلية الموجودة في النطفة المنوية، وينتج عن هذا الالتصاق 64 كروموسوم، والجدير بالذكر أن الكروموسوم هو عبارة عن خيوط دقيقة جدًا تحمل حمض الـ DNA الذي يحدد الصفات الوراثية للجنين. وأثناء هذه الفترة تكون البويضة المخصبة عبارة عن 23 زوجًا من الخلايا المُقسمة."),
  MyBaby(
      description:
          "يصل جسم الطفل في هذه المرحلة إلى حجم بذور الخشخاش، وبالتالي يكون طوله حوالي 2 ملميتر. ويكون شكل الجسم في الفترة السابقة على هيئة كرة محاطة بمئات الخلايا المجوفة والمملوئة بالسائل. ولكن في الأسبوع الرابع يتغير شكل الخلايا المجوفة حيث تنموا وتأخذ شكل قرص يتكون من ثلاث طبقات، والتي تكون بداخل كيس امنيوني دقيق من حيث الصغر وهذه الأغشية حية."),
  MyBaby(
      description:
          "يكون الجنين في هذه الفترة في حجم حبة السمسم، حيث يبلغ طوله حوالي ثلاثة ملميتر، في هذه الفترة عليك أن تتجنبي التدخين وشرب الكحوليات والممنوعات حتى لا يتعرض الجنين للخطر. والجدير بالذكر أن الدورة الشهرية تتوف بسبب انتاج بعض المنشطات المشيمية المنسلية التي تتسب في ذلك."),
  MyBaby(
      description:
          "يكون حجم الطفل في الأسبوع السادس بوزن حبة العدس، وطوله يكون نحو 5 ملميتر. وفي هذا الأسبوع يبدأ قلب الجنين في النبض كما تتشكل الأصابع ويحدد فتحات الانف والاذنين والعينين. كما يتكون الحبل السري، ويبدأ الجنين في التحرك بحركة بسيطة لا تشعر بها الأم."),
  MyBaby(
      description:
          "يصل حجم الطفل في هذه المرحلة إلى حجم حبة الحمص، ويبلغ طوله نحو 1，2 سنتميتر. يحيط بالجنين حاجز واقي وبالكيس الامنيوني، والذي يتكون عليه زغابات حملية، والتي تكون سبب في الشعور بالغثيان نظرا لأن هذه الزغابات تتجانس في مجرى دم الأم حتى تتكون المشيمة. كما ينضج قلب الجنين حتى بنقسم إلى شق في اليمين وشق في اليسار."),
  MyBaby(
      description:
          ": يكون حجم الطفل مقارب إلى حجم حبة الفاصولياء وبالتالي يصبح طوله 1，6 سنتميتر، أي يصل حجم الطفل إلى 1 غرام. ويكون جسم الجنين قد اكتمل من حيث الأعضاء الداخلية الرئيسية والخارجية والأطراف، وتظهر هيئة الطفل كامل التكوين. ويصل الغذاء إلى الجنين من خلال المشيمة والتي توصل الغذاء من مجرى دم الأم إلى الحبل السري للطفل."),
  MyBaby(
      description:
          "•	يكون حجم الجنين مثل حبة العنب. •	الطول 2.3 سم. •	الوزن 2 جرام. •	قد يتحرك الجنين ولكن لا تشعر به الأم، ينمو ذراعيه وساقيه وكذلك الرقبة وتبدو بعضا من ملامحه."),
  MyBaby(
      description:
          "يكون وزن الطفل في الاسبوع العاشر بحجم وزن حبة الزيتون الأخضر، ويبلغ طوله 3，1 سنتميتر، أي يبلغ وزنه نحو 4 غرام. وفي هذا الأسبوع يتخطى الجنين مراحل الخطر ويثبت في الرحم حتى أنه يبدأ في التنفس."),
  MyBaby(
      description:
          "الجنين في هذه الفترة حجمه كحجم حبة التين، حيث يبلغ وزنه 7 غرام، أما طوله فهو يصل الى 4.1 سم، وخلال الأسابيع القادمة يتضاعف حجمه بشكل سريع وملحوظ، وربما تلاحظ الام ان حجم راس جنينها أقل بكثير من طول جسمه، وهذا الامر طبيعي ولا يدعو للقلق، يبدأ القلب في عمله بضخ الدم الى جميع أجزاء الجسم، كما يبدأ الطفل في التثاؤب والبلع والمص."),
  MyBaby(
      description:
          "•	يكون الطفل أكبر حجما مثل حبة الليمون الأخضر تقريبا. •	الطول: يصبح طول الطفل 5.4 سم. •	الوزن: يكون وزنه 14 جم تقريبا. •	يمكن سماع نبضات قلب الطفل من خلال جهاز خاص يستخدمه الطبيب يسمى الدوبلر. •	تبدأ أطراف الطفل في النمو مع قدرته على تحريك أصابع يديه، تظهر أيضا الأعضاء التناسلية للطفل داخل الرحم. •	تبدأ معظم أعضاء الطفل في النمو."),
  MyBaby(
      description:
          "•	طول الطفل مثل قرن البازلاء. •	الطول: 7.4 سم. •	الوزن: 23 جم. •	يمكن للطفل سماع الأصوات وتسجيلها من خلال الذبذبات التي تصل إلى الجلد. •	يمكن التكلم مع الطفل والتحدث له. •	قد تظهر صورة وجه الطفل، ويبدأ بالتحرك بشكل سريع ولكن لا تشعر الأم بهذه الحركة."),
  MyBaby(
      description:
          "هل تعلمين أن حجم طفلك في الشهر 14 من الحمل مماثلا لحجم ثمرة الليمون الكبيرة الحجم، طوله يبلغ 8.7 سم أما وزنه فهو حوالي 43 غرام، وهذا الوزن يختلف من جنين إلى أخر، نمو العضلات والعظام، ولهذا يفضل الإكثار من تناول الحليب والجبن باعتبارها من أهم الأطعمة التي تمد الجنين بالكالسيوم اللازم لبناء العظام والعضلات. تتشكل الرقبة والأذنين، ويصبحوا أكثر بروزا من ذي قبل، يبدأ الجنين في تحريك اليدين والقدمين، فهو بمثابة الأصابع الصغيرة، أصبحت أظافر القدم أكثر بروزا من ذي قبل، يتمكن الطبيب خلال هذه الفترة من تحديد جنس الجنين ومعرفة اذا كان ذكر أو أنثي عبر الأشعة الفوق الصوتية."),
  MyBaby(
      description:
          "•	حجم الطفل مثل التفاحة. •	الطول: 10.1 سم. •	الوزن: 70 جم. •	يبدأ الطفل في تماسك أطرافه، ويكون حجمه قد نما بعض الشيء ليكون مثل كف اليد. •	ينصح بتناول البروتينات الخالية من الشحوم والأسماك والدجاج خلال هذه الفترة بسبب نمو الجنين بشكل متزايد. •	يغطي جسم الجنين طبقة خفيفة من الشعر. •	يبدأ جسم الجنين في تكوين العظام بشكل مشدود."),
  MyBaby(
      description:
          "حجم الطفل في الأسبوع 16 من الحمل، يكون مماثلا لحجم ثمرة الإجاص، وزن الطفل بهذه المرحلة 100 غرام تقريبا اما طوله فهو يبلغ 11.6 سم، ينصح كل أم بمتابعة وزن طفلها بعناية طوال فترة الحمل، يبدأ الطفل في هذه الفترة بمص اصبع الابهام وكانه باحثا عن حلمة ثدي أمه، كما تزداد طول رقبة الطفل خلال هذه الفترة وتصبح اكثر طولا من ذى قبل، مع تحريك الأذنين ليصبح كلا منهم في مكانه الطبيعي والمعتاد، وتبدأ الحواجب والرموش في الظهور بشكل تدريجي بداية من الشهر 16 من الحمل."),
  MyBaby(
      description:
          "•	حجم الطفل مثل حبة الزنجبيل. •	الطول: 13 سم. •	الوزن:140جم. •	يصبح الجنين أثقل وزنا وأطول بسبب تكون الشحوم. •	شعور الأم بحركة الجنين."),
  MyBaby(
      description:
          "●	يزيد حجم طفلك بهذا الاسبوع، ويصبح في حجم حبة الفلفل الحلو. ●	طول الطفل: 14.2 سنتيمتر. ●	وزن الطفل: 190 جراما. ●	يبدأ ظهور بعض الشعيرات الخفيفة الناعمة على رأس الطفل، والتي تسمى ب (زغب الحمل). ●	يبدأ في هذه الفترة ظهور الرموش وتشكيلها، ويكون النمو في هذه المرحلة بشكل سريع وكبير عن المراحل السابقة."),
  MyBaby(
      description:
          "●	يكون الطفل في هذا الاسبوع بحجم حبة الطماطم. ●	طول الطفل: 15.3 سنتيمتر. ●	وزن الطفل: 240 جراما. ●	ينمو الجهاز العصبي للطفل في هذه الفترة، ويمكن للطفل الاستجابة لبعض الأصوات، وعند تقريب الضوء من بطنك سوف يقوم الطفل بمتابعته، وسوف تلاحظين حركته. ●	تعمل المشيمة على وقاية الطفل ضد العدوى والأمراض المختلفة، ولكن عليك تجنب الإصابة بالفيروسات المختلفة مثل الحصبة الألمانية."),
  MyBaby(
      description:
          "- حبة الموز هي أكثر شكل تقريبي لحجم ابنك في هذا الأسبوع. - ومن بداية هذا الأسبوع يقوم الطبيب بمتابعة طول ابنك من رأسه حتى قدميه عن طريق لأشعة. - وغالبا ما يكون طول 16,4 سنتيمتر من رأسه حتى مؤخرته و25,6سنتيمتر من رأسه حتى أخمص قدميه ووزنه 300 جرام. - كما أن مفاصل يديه تبدأ بالنمو ويتضح ملامح وجهه طفل صغير مع نمو أحداب عينيه في وجهه الصغير للغاية. - ينمو الجلد في هذه المرحلة في الناحيتين السفلية والعلوية. - هذا النمو للجلد مع بقائه مغطى بطبقة دهني تقوم بحمايته من السائل الأمنيوني. - ويجب أن تشربي الكثير من الماء لان فضلات طفلك تمر عبر أعضاء جسمك ويجب أن يتخلص الجسم منها بالماء الكثير."),
  MyBaby(
      description:
          "أصبح طفلك في حجم الجزرة تقريبا، وزنه حوالي 360 غرام أما طوله فهو يصل إلى 26.7 سم، مازال حجم الجنين صغير جدا في حجم الجزرة بما يجعله قادرا على السباحة بكل حرية داخل السائل الامنيوني، وبالرغم من صغر حجمه إلا أن مختلف الأجهزة العضوية بدأت في النمو والنضج، وبدأ الشحم يتكون على جسم الجنين. وبالرغم من صغر حجم الجنين، إلا أن لديه رغبة في تناول الأطعمة التي تحتوي على السكريات، وفي المقابل ينفر الجنين من الأطعمة المرة، باعتبار أن مذاق هذه الأطعمة يتسلل إلى السائل الامنيوني ولهذا يشعر الجنين بمذاقها. هل تعلمين أن طفلك في هذا الأسبوع أصبح قادرا على تمييز صوتك، ولهذا يفضل تحدث الأبوين مع الجنين خلال هذه الفترة، الجنين قادرا على تمييز صوتهم في هذا الأسبوع، كما يتسلل الصوت الناتج عن استخدام مكبرات الصوت إلى الجنين عبر جدار البطن، ولهذا يفضل تشغيل القرآن الكريم وأصوات الموسيقى، مع تجنب الأصوات العالية والمزعجة، شجعي زوجك على التحدث إلى للجنين خلال هذه الفترة."),
  MyBaby(
      description:
          "هل تعلمين أن طفلك بحلول هذا الاسبوع، أصبح في حجم ثمرة الخيار طوله حوالي 27.8 سم، أما وزنه فهو يبلغ 430 غرام، أصبحت بشرة الطفل أكثر نموا ونضجا، يغطي جلد الجنين بطبقة قشدية التركيب بيضاء اللون، يطلق على هذه الطبقة اسم برنيق ومن شأنها حماية جلد الطفل من السائل الأمنيوني، يغطي رأسه بطبقة رقيقة من الشعر، تشكلت حواجب الطفل بحلول هذا الاسبوع. اكتمل نمو الجهاز الهضمي وأصبح قادرا على أداء وظيفته، أصابع القدم في مراحل النمو الأولى، وقد أصبح طول الساقين متناغما مع طول الجسم ككل، بالرغم من أن عين الجنين مازالت مغلقة إلا أنه بإمكانه التحرك في اتجاه الضوء."),
  MyBaby(
      description:
          "حجم الطفل بحلول هذا الاسبوع في حجم ثمرة المانجو، وزنه بالتقريب نصف كيلو جرام، وطوله 28.9 سم، هل تعلمين أنه كلما مسحت على بطنك كلما ساعدتي طفلك على نمو دماغه بشكل أفضل، تنمو عضلات جنينك وتتمدد بشكل سريع، ودليلك على ذلك هو شعورك المستمر بركلات الطفل في ضلوعك، أما شعر الجنين فهو مجعد والسبب في ذلك قلة الشحوم تحت جلده."),
  MyBaby(
      description:
          "وزن طفلك في هذا الأسبوع حوالي 600 جرام، أما طوله فهو 30 سم، حجمه في هذا الأسبوع مثل حجم كوز الذرة، يتكون براعم الأسنان تحت اللثة، تزداد حدة سماع جنينك كما تزداد لديه حاسة التذوق، لم تكتمل رئة الجنين بحلول هذا الأسبوع ولهذا فهو يواجه صعوبة في التنفس إذا ولد في هذا الأسبوع، يصحو الجنين لفترة ويرتاح لفترة، وغالبا ما يبدأ في النشاط في فترة استراحة الأم."),
  MyBaby(
      description:
          "	يكون الجنين في هذه الفترة في طول الكراث، أي حوالي 34.6 سم، أما وزنه فيتخطى النصف كيلو ويكون حوالي 660 خرام. 	تتكون البصمة الخاصة بطفلك حيث تبدأ خطوط جلد الأصابع في التشكل. 	 كما يمكن للجنين في هذه الفترة أن يقبض يديه ويمسك قدميه. 	تبدأ هيئة الجنين في الوضوح ويبرز وجهه بصورة أكبر. 	تبدأ رأس الجنين في التشكل والوضوح لتكون مثل رأس الطفل حديث الولادة، وعلى الأم أن تساعد في هذا النمو عن طريق الامتناع عن العادات والمشروبات الضارة التي تضر الجنين وتضر الأم. 	يمكن للجنين أن يقوم بالنشاطات، كما أنه يأخذ فترات من الراحة."),
  MyBaby(
      description:
          "حجم طفلك في هذه الفترة صغير للغاية، فهو في حجم ثمرة البصل الأخضر، يبلغ وزن الجنين في الاسبوع 26 حوالى 760 غرام أما طوله فهو 35.6 سم، أصبحت العضلات مكتملة تماما في هذا الشهر، ويتبعها زيادة في حجم العضلات، يغطي جسم الجنين في هذا الأسبوع بطبقة شمعية من أجل حمايته."),
  MyBaby(
      description:
          "- يبلغ حجم طفلك في هذا الأسبوع إلى ما يقارب حجم رأس زهرة القرنبيط الصغير طوله: 36,6 سنتيمتر ووزنه 875 جراما. - ويكون وزن 875 جرام ما يقارب نص كيس من السكر. - وأهم ما يميز هذا الأسبوع أن الطفل فيه يبدأ بفتح عينية. - كما أنه يسمع الأصوات المختلفة ويكون له رده فعل لها."),
  MyBaby(
      description:
          "يكون شكل الطفل مثل الباذنجان أي يبلغ طوله نحو 37，6 سنتميتر، ويزن جسمه 1000 غرام، تتزايد أنسجة دماغ الجنين وبعد مرور 24 شهرا تظل دماغه طرية. كما يكون الجنين قادر على التحكم في حرارة جسمه، وتتكون كرات الدم الحمراء في جسم الجنين وبالتالي يحتاج من الأم تناول أطعمة غنية بالحديد"),
  MyBaby(
      description:
          "- طول خضار الكرفس هو الطول التقريبي لطفلك في هذه المرحلة ويكون طوله 38,6  سنتيمتر ووزنه 1,2 كيلو غرام. - ويجب في هذه المرحلة تناول الكثير من البروتين بسبب تواصل نمو الطفل المستمر مما يجعله يحتاج إلى الكثير من البروتين. - وتصبح هيئة طفلك هذا الأسبوع مكتملة ولكنها صغيرة. - ويناسب هنا الرأس مع حجم الجسم وليس اكبر."),
  MyBaby(
      description:
          "يكون طفلك في هذا التوقيت بحجم ثمرة الملفوف الصغيرة الحجم، وزن الجنين في هذه المرحلة حوالي 1.3 كيلو جرام، أما طوله فهو يبلغ 39.9 سم، أسابيع قليلة فاصلة بين موعد الولادة ولهذا تبدأ مهارات المص والبلع لدى الجنين بالنمو والنضج استعدادا لعملية الرضاعة عقب الولادة."),
  MyBaby(
      description:
          "يكون حجم الطفل في هذه المرحلة بحجم جوز الهند والذي يبلغ طوله نحو 41，1 سنتميتر ويكون وزنه 1，5 كيلو غرام. في ذلك الوقت يكون الطفل قادر على النظر وبالتالي يحتاج إلى فيتامين أ بكثرة لأنه مهم للنظر، وينصح بعدم تناول الكبدة. تكون حركة الطفل في هذه الفترة طبيعية ومتناسقة. حجم الطفل متزايد وأيضا المساحة المحيطة به كافية لحركة الطفل بسهولة. يحتوي جسم الكفل على نسبة من الشحوم تصل إلى 50 غرام، وتتزايد هذه النسبة كلما أقترب موعد الولادة حتى تكون 15 %."),
  MyBaby(
      description:
          "- الحجم التقريبي لطفلك هنا هو حجم نبات الكايل فيصل طوله إلى 42,4 سنتيمتر ووزنه 1,7 كيلو غرام. - في هذه الأيام يكون جهاز المناعة لدى الطفل في تطور مستمر حتى يحميه عند خروجه للحياة من الأمراض التي قد تصيبه ويستمد الطفل تلك المناعة من جهاز مناعة الأم سواء عند التكوين أو التطور."),
  MyBaby(
      description:
          "بالوصول الى هذا الاسبوع يعني ان حجم طفلك مساويا لحجم ثمرة الأناناس، وزن الطفل 1.9 كيلو جرام وطول الطفل 43.7 سم، الطفل متكامل، إكتمل نمو جميع أجهزته العضوية، ولكنه يحتاج إلى القليل من الوقت من أجل زيادة وزنه حتى يصل إلى الحجم الطبيعي، طفلك يستمع إلى صوتك وكافة الأصوات المحيطة به، ولكن بمعدل يقل عن نصف ما تسمعه الأم."),
  MyBaby(
      description:
          "يبلغ حجم الطفل في هذه المرحلة حجم ثمرة الشمام المتوسطة في الحجم، والذي طوله 45 سنتميتر، أي يصبح وزنه 2，1 كيلو غرام. العالم الذي يعيش فيه الجنين خلال الشهور الثلاث الأخيرة من الحمل يكون معظمه في النوم، وأيضا يساعد ذلك على تحفيز نمو الدماغ للجنين، فهي فترة الأحلام للجنين. تتطور الرئتين في النموا حتى تكتمل وهم أخر الأعضاء في التكوين والنمو."),
  MyBaby(
      description:
          "- يكون طفلك بحجم شمام العسلي في هذا الأسبوع ويكون طوله 46,2 سنتيمتر ووزنه 2,4 كيلو غرام. - وقد أثبتت الدراسات في ايرلندا أن الطفل في هذا الأسبوع يكون عنده قدرة على استيعاب الأشياء التي يسمعها من الخارج والاستجابة لها خاصة نغمات ترانيم حضانة الطفل وهى نغمات مخصصة الأطفال حديثي الولادة. - ويمكنك معرفة جنس طفلك إن كان يوجد في زاوية مناسبة داخل الرحم تجعل الأشعة تكشف جنسه بسهولة."),
  MyBaby(
      description:
          "يكون حجم الطفل في الأسبوع 36 بحجم ثمرة الخس، أي يصل طوله إلى 47，4 سنتميتر ويصل وزنه إلى 2，6 كيلو غرام. حجم الجنين يكون بملئ المكان وبالتالي يصعب الحركة فيه، إلا أن الجنين يقوم باتخاذ وضع الولادة ويضع رأسه أسفل الحوض. وبهذا يكون الجنين قابل للولادة في هذا الوقت."),
  MyBaby(
      description:
          "أصبح طفلك أكثر نضجا من ذى قبل، وزنه حوالي 2.9 كيلو جرام، أما طوله فهو 48.6 سم فهو في طول السلق تقريبا، فى هذا الأسبوع اكتملت رئة طفلك، ولن يواجه طفلك اى مشاكل في التنفس إذا تم ولادته بهذا الأسبوع. يحصل الجنين على المضادات الحيوية التي يحتاج إليها من جسم الأم، وهذه المضادات تجعله أكثر قدرة على الوقاية من الأمراض المختلفة، يزداد طفلك تدريجيا في الحجم وبذلك تقل مساحة الرحم وتصبح ضيقة للغاية وغير قادرة على تحمل مساحة الجنين، وقد أشارت دراسة حديثة إلى الجنين يصدر هرمونات الجهد والدفع المحفزة لعملية المخاض وذلك لعدم وجود مساحة كافية للحركة."),
  MyBaby(
      description:
          "ازداد حجم الطفل ليصبح في حجم ثمرة فاكهة جاك، طول الجنين 49.8 سم ووزنه 3 كيلو جرام، في هذه المرحلة تصبح أمعاء الطفل ممتلئة بالغائط وهي الإفرازات الناتجة من مجاري الهضم وغيرها من الفضلات، أما لونه فهو أخضر قاتم اللون."),
  MyBaby(
      description:
          "أصبح وزن الطفل في هذا الأسبوع 3.3 كيلو جرام وطوله 50.7سم، وهذا الوزن يختلف من طفل إلى آخر، فهو في حجم ثمرة البطيخ، أصبح الجنين كبير الحجم، اكتملت عملية النضوج، جميع أعضاء الجسم مكتملة وجميع أجزاء جسمه الصغير اكتملت، بشرة الطفل ناعمة كالحرير، يغطي جسم الطفل طبقة من الشحم، يستمد الجنين طعامه من أمه عبر المشيمة لحين لحظة الولادة، فهو يستعد للخروج في أى لحظة."),
  MyBaby(
      description:
          "أصبح الطفل في هذا الأسبوع كبير الحجم في حجم ثمرة اليقطين، فقد اكتمل تكوينه بالكامل، وزنه 3.5 كيلو جرام وطوله 51.2 سم، حجم الطفل كبير ومساحة الرحم ضيقة للغاية، ولا يمكنه التحرك في هذه المساحة الضيقة، يغطي رأس الجنين بالشعر، ولكن سريعا ما يتساقط ولا يبقى منه إلا قليل في الجبهة.")
];

class MyText {
  String name;

  MyText({this.name});
}

List myTexts = [
  MyText(name: "HHHHHHHHHHHH"),
  MyText(name: '" بدأ العد التنازلي "'),
  MyText(name: '" بدأ البويضات"'),
  MyText(name: '" انت الان حامل "'),
  MyText(name: '" هل من شعور مختلف ومتفاوت ؟ "'),
  MyText(name: '" دورة شهرية متأخرة "'),
  MyText(name: '" بعض الوخز والم في الثديين"'),
  MyText(name: '" هل ماتشعرين به هو شعور بالدوخة او تراخي"'),
  MyText(name: '" تعب و ارتخاء "'),
  MyText(name: '" تمدد وشد خط الخصر  "'),
  MyText(name: '" احاسيس ومشاعر متزايدة "'),
  MyText(name: '" شعور بالعطش "'),
  MyText(name: '" تضاءل خطر الاسقاط"'),
  MyText(name: '" تباطؤ الهضم "'),
  MyText(name: '" توسع الرحم  "'),
  MyText(name: '" تغيرات في البشرة "'),
  MyText(name: '" التحاليل والفحوصات "'),
  MyText(name: '" هاهو بطنك قد بدأ يبرز  "'),
  MyText(name: '" عودة لشهوتك  "'),
  MyText(name: '" مزيد من العناية باللثة "'),
  MyText(name: '" قد تشعرين بحركة الطفل  "'),
  MyText(name: '" ها قد بدأ وزنك بالإزدياد  "'),
  MyText(name: '" يبدأ اللباء بالتسرب من الثديين  "'),
  MyText(name: '" مراجعة أخصائي العيون "'),
  MyText(name: '" مزيد من الطاقة والحيوية  "'),
  MyText(name: '" ربما شعرت بألم في الظهر  "'),
  MyText(name: '" تجنبى أجهاد نفسك  "'),
  MyText(name: '" بطنك وقد ازداد حجما  "'),
  MyText(name: '" تشعرين بركلات متتالية  "'),
  MyText(name: '" المزيد من الفحوصات "'),
  MyText(name: '" تقلبات المزاج هي شئ مألوف و شائع "'),
  MyText(name: '" التزمي بمواعيد العيادة  "'),
  MyText(name: '" الام و صداع متزايد  "'),
  MyText(name: '" صعوبة في النوم  "'),
  MyText(name: '" قللي من ساعات العمل  "'),
  MyText(name: '" أحاسيس من الترقب والخوف  "'),
  MyText(name: '" أحلام مفعمة بالحيوية  "'),
  MyText(name: '" تمارين للتقلصات و الانقباضات  "'),
  MyText(name: '" اتزني في حركاتك و قوامك  "'),
  MyText(name: '" انت مقربة من الحدث  "'),
  MyText(name: '" انه الحدث في اي لحظة "'),
];

class MyModel {
  String content;

  MyModel({this.content});
}

List mymodels = [
  MyModel(content: "nnn"),
  MyModel(
      content:
          "من أجل زيادة فرصة الحصول على طفل ذكر، لا تقومي بالعلاقة الحميمية إلا بعد مرور أسبوع من التبويض، فبعد مرور هذه الفترة يمكن القيام بالعلاقة الحميمية ولكن وبطبيعة الحال في يوم التبويض فقط. أما من أجل زيادة فرصة الحصول على أنثى، فعليك القيام بالعلاقة الحميمية بين يوم وأخر بعد انتهاء الدورة الشهرية وذلك حتى مرور ثلاثة أيام من التبويض، وبصورة أوضح قبل ثلاثة أيام من التبويض، وفي الغالب يكون في منتصف الشهر للدورة للشهرية."),
  MyModel(
      content:
          'يختلف شعور الحامل خلال فترة الحمل من أسبوع إلى أخر وسوف نوضح مظاهر هذا الاختلاف على كلا من الحامل والجنين: •	جسم الحامل: ليس كل السيدات مدة الدورة لديهم منتظمة، ولكن أغلب السيدات تكون مدة دورتهم 28 يوما وبالتالي يكون ميعاد التبويض لديهم في اليوم 14، وهذا الميعاد ثابت مهما كانت مدة الدورة. ويتراوح عمر البويضة منذ فترة خروجها من المبيض حتى موتها نحو 12-24 ساعة تظل فيهم حية وقابلة للإخصاب في أي وقت خلال هذه الساعات. لا تحتاج عملية الإخصاب إلى وقت طويل لإتمامها، نظرا لأن عدد كبير من الحيوانات المنوية يصل إلى 250 مليون حيوان منوي يحاولوا الوصول إلى البويصة المتواجدة في اسفل قناة فالوب لتخصيبها. نصائح وإرشادات وينصح خلال هذه المرحلة بتناول الأطعمة التي تحتوي على حامض الفوليك وأيضا الغنية بفيتامين ب. وهذه الأطعمة الغنية مثل الخضار والبقوليات والفاصوليا والزبادي. كما ينصح بتناول البيض والرز الاسمر والحبوب المختلفة التي تحتوي على حامض الفوليك والفيتامينات.'),
  MyModel(
      content:
          'في غالب الأحوال لا تسطيع المرأة أن تعرف بحملها منذ لحظة حدوثة، حيث أن في هذا الوقت لا يحدث تغيرات في سلوك الهرمونات يمكن من خلالها معرفة حدوث الحمل، كما أنه من المعروف أن حدوث الحمل يكون بعد مرور أسبوعين على الدورة الشهرية الأخيرة للمرأة. ويحدث الحمل عند انتقال النطفة المئوية إلى البويضة بجانب ملايين الحيوانات المنوية التي تتخطى عددها الـ 300 مليون حيوانًا منويًا من أجل تخصيب البويضة، ومن هنا تبدأ حياة الجنين ويتحدد ما إذا كان ذكرًا أو أنثى.'),
  MyModel(
      content:
          "بعد الوصول إلى الأسبوع الرابع من مدة الإخصاب، تقوم البويضة المخصبة بالمرور في قناة فالوب حتى تصل إلى جدار الرحم، وتلتصق في هذا الجدار حتى يكتمل نمو هذه الخلايا. وبمرور الوقت يزداد حجم البويضة المخصبة وبالتالي يتسع حجم الرحم ويتمدد وتزداد ليونته، كما يتغير عنق الرحم أيضا ويختلف قوامه. حتى تلتصق البويضة في جدار الرحم بإحكام ويتم تثبيتها قد ينتج عن ذلك وجود قطرات من الدم، ولهذا لا تقلقي بشأن هذا الأمر فهو طبيعي، خلال هذه الفترة"),
  MyModel(
      content:
          "في هذه الفترة يكون ميعاد دورتك الشهرية قد فات في الغالب، وسوف تبدأ أعراض الحمل في الظهور مثل التعب، بالإضافة إلى الشعور بألم يسير في الثدي، كما أن مشاعرك سوف تتغير، ويتكون في الرحم صمام مخاطي من أجل حماية الرحم، ولذلك نجد أن جدار الرحم يلين إلى حد كبير."),
  MyModel(
      content:
          "أول مظاهر الأسبوع السادس هو شعور بالوخز وآلم في الثديين، وأيضا تشعر الحامل برغبة في الغثيان ودوخة والتي تزداد خاصة في الصباح، وذلك يحدث بسبب وجود تغيرات هرمونية، ونقصان في الشهية إتجاه بعض الأطعمة. كما تشعري أيضا بسبب زيادة افراز الهرمونات برغبة في ارتياد الحمام بكثرة، يزداد الشعور بآلم في الثدي ويتم بروز حلمات الثدي تدريجيا، كما يزداد حجم البطن والخصر."),
  MyModel(
      content:
          'عندما يصل الطفل إلى الأسبوع السابع يبدأ تشكيل الأعضاء الرئيسية في جسم الطفل. وهذا يؤدي إلى شعور الأم بالدوخة والتراخي، ويحب عليها أن تقلل من الحركة لتلافي التعرض للاسقاط. كما تتغير الحالة النفسية للأم خلال هذه المرحلة لتصبح عصبية ومتقلبة المزاج، ويكون لديها حاسة شم وتذوق كبيرة تجاه بعض الأطعمة. وقد يرجع السبب في هذه الأعراض إلى زيادة نسبة افراز الهرمونات وأيضا انخفاض السكر في الدم والتعرض للارهاق بسبب الحمل.'),
  MyModel(
      content:
          'في الاسبوع الثامن يحاول الجسم التكيف مع الحمل والتطورات التي تحدث. حيث يصبح نبض قلب الأم سريع ويصل معدل التمثيل العضوي إلى نسبة 25 % وبالتالي يكون الجسم في حاجة إلى الراحة ويزداد الشعور بالاسترخاء كما يقل هذا الشعور تدريجيا بعد الاسبوع 12. كما يزداد تمدد الخصر ومنطقة البطن بالكامل. وتحتاجي سيدتي إلى متابعة الحمل مع طبيب على فترات، قد تتعرضي إلى تشنج في العضلات وهذا أمر طبيعي ليس هناك قلق من حدوثه، وفي حالة وجود نزيف يجب استشارة الطبيب فورا.'),
  MyModel(
      content:
          'تمدد الرحم •	ينصح في هذه الفترة الإكثار من تناول البروتين على الرغم من شعور الأم في بدايات الحمل بعدم الرغبة في تناول الطعام. •	سوف تشعر الأم بتمدد منطقة الخصر وخاصة إذا كانت هذه ليست التجربة الأولى للحمل. •	كما تشعر الأم نتيجة تمدد الرحم بثقل على المثانة. •	هناك أيضا عدد من الأعراض قد تظهر نتيجة تمدد الرحم مثل الوخز المتقطع وكذلك بعض الآلام ولكن لا داعي للقلق هذه الأعراض طبيعية. •	قد تلاحظ الأم الحامل بعض التغيرات على الوجه مثل انتفاخه ونعومة ملمسه وقد تظهر عليه بعض البقع، كما ستشعر بجفاف الشعر الدهني.'),
  MyModel(
      content:
          'نظرا لتمدد الرحم في الاسبوع العاشر يضغط على المثانة وبالتالي تشعر الأم بحاجة إلى دخول الحمام باستمرار. كما يظل الشعور بالغثيان والدوخة والتعب في هذه المرحلة مسيطر على الأم. يظهر تغيير في شكل وحجم الثدي. كما تشعري في هذه الفترة بالحساسية الشديدة تجاه الأشخاص والأشياء والتي قد تؤدي إلى حالات من النحيب وذلك بسبب تغيرات الهرمونات التي في الجسم، فقد تكوني لفترة حزينة ومكتئبة وفترة أخرى سعيدة وفرحة دون سبب وأيضا عدم استقرار الحالة النفسية والشعور بأحاسيس مختلفة.'),
  MyModel(
      content:
          'الاسبوع 11 من الحمل خلال هذه الفترة يطرأ على جسم المرأة الحامل العديد من التغييرات وابرزها الشعور بالعطش بشكل غير عادي، وهذا يعني ان جسمك في حاجة شديدة الى تناول السوائل واهمها الماء والعصائر الطبيعية، وخلال هذه الفترة تشعر المراة الحامل برغبة شديدة في الذهاب إلى الحمام بشكل متكرر نتيجة تناول كمية كبيرة من السوائل. تزداد هرمونات الحمل في الدم ويزداد تأثيرها على مستوى السكر في الدم، مما يتسبب في الشعور الدائم بالدوار ويتبعه عدم القدرة على القيام بالمهام اليومية بشكل طبيعي، وفي كثير من الأحيان يطلب الطبيب من السيدات الحوامل في هذه الفترة إجراءات أشعة على الرحم للتأكد من عدم وجود اعراض متلازمة داون.'),
  MyModel(
      content:
          'تجاوز خطر الإجهاض •	يثبت الحمل بنسبة 65%، وتعتبر هذه الفترة هي نهاية أولى فصول الحمل. •	يصبح الرحم أكبر قليلا في الحجم ليصل حجمه إلى حجم البرتقالة. •	يمكن للأم الحامل أن تقوم بالفحص باستخدام الموجات الفوق صوتية. •	قد تقل حالات الشعور بالغثيان والقيء على الرغم من وجود بعض الحالات تصاحبها هذه الأعراض حتى نهاية الحمل، ومن الجدير بالذكر أنه ينصح بتناول القليل من البسكويت الخفيف قبل تحرك الأم من سريرها. •	تشعر الأم الحامل في هذه الفترة بثقل في الساقين والرحم والثديين، كما تلاحظ أيضا زيادة في الوزن.'),
  MyModel(
      content:
          'الهضم •	نتيجة ارتفاع هرمون البروجسترون يقل عمل الأمعاء ويتصلب البراز وتزداد حالات الإمساك، كما أن نمو الرحم يعمل على تقليل عمل المعدة وعدم القدرة على الهضم بصورة سليمة. •	ومع ذلك فإن الشعور بالدوار والدوخة يقل تدريجيا إن لم يكن قد تلاشى وتبدأ الأم في استعادة حيويتها. •	قد تبدأ الأم في الشعور بحركة قوية وبصورة مفاجئة أسفل البطن نتيجة نمو الرحم.'),
  MyModel(
      content:
          'الاسبوع 14 من الحمل يزداد حجم الجنين ويزداد حجم الرحم خلال هذا الأسبوع من الحمل، أصبح حجم الرحم في هذا الأسبوع بحجم البطيخة، وأصبح من السهل على الطبيب تحسس أعلى منطقة الرحم، فهو أعلى عظمة العانة، تعرف معنا خلال السطور التالية على أبرز التغييرات التي تطرأ على الأم وجنينها خلال هذا الأسبوع من الحمل. أبرز التغييرات في جسم الحامل •	كما يزداد حجم الرحم، يزداد وزن المرأة الحامل، وتصبح الملابس ضيقة وغير مريحة، ولهذا يفضل ارتداء الملابس الخاصة بالحمل ابتداء من الشهر 14 من الحمل. •	عادة ما تفقد السيدات الحوامل الشهية في هذا الشهر من الحمل، ويمكنك التغلب على ذلك بتناول بعض من الحليب أو العصير الطبيعي الفريش في فترة الصباح. •	الإكثار من تناول الحليب والجبن والزبادي.'),
  MyModel(
      content:
          'تغيرات الجسم •	قد تلاحظ الأم الحامل تغيير في البشرة وخصوصا الشامة حيث يزداد لونها الداكن. •	هناك تغيرات قد تحدث في حلقة حلمة الثدي. •	تظهر الشرايين العنكبوتية على الرقبة والوجهة والصدر والأذرع بشكل واضح بسبب ارتفاع نسبة الاستروجين. •	حتى تتجنب الأم الحامل الشعور الدائم بالغثيان من رائحة الطبخ يمكن تناول الخضروات المسلوقة للاستفادة منها أيضا بشكل كامل. •	يتمدد الرحم ليصبح بشكل بطيخه متوسطة، كما تلاحظ الأم الحامل زيادة نضارة البشرة.'),
  MyModel(
      content:
          'الاسبوع 16 من الحمل يطلق عدد من الأطباء على هذه الفترة اسم التحاليل والفحوصات، وذلك لضرورة إجراء المراة الحامل لعدد من الفحوصات الطبية بهذه الفترة، التي من شأنها التأكد من صحة الجنين وخلوه من العيوب الخلقية والاعراض الغير طبيعية، تابعوا معنا السطور التالية لمعرفة أبرز التغييرات الطارئة على الأم الحامل والجنين خلال هذه الفترة.'),
  MyModel(
      content:
          'بروز البطن قد تظهر عدد من التغيرات على الجسم والبشرة منها: •	بروز البطن مع وجود خط داكن يظهر وسط البطن. •	نضارة البشرة بسبب زيادة تدفق الدم. •	ارتفاع الرحم وامتداده خارج الحوض. •	تبدأ الأم بالشعور بتحركات الطفل الأولى. •	شعور البعض بحالة الحرقان أثناء التبول بسبب العدوى البولية. •	بسبب زيادة الدورة الدموية يشعر البعض بانسداد الأنف. •	يجب على الأم الحامل شرب المزيد من السوائل للاحتفاظ بمعدلها داخل الجسم.'),
  MyModel(
      content:
          '●	في هذا الاسبوع تبدأ رغبتك الجنسية في استعادة نشاطها مرة أخرى وزيادة الشعور الجنسي؛ وذلك بسبب زيادة هرمون الاستروجين في الجسم، مما يؤدى إلى تدفق الدم في منطقة الحوض. ●	يمكنك ممارسة الجماع، ولكن بشكل متأنى؛ فهو آمن بإذن الله. ●	في هذه المرحلة تظهر الرغبة الشديدة في الأكل والاستمتاع به، ولكن عليك بتناول الغذاء الصحي، والأطعمة المفيدة المغذية التي لا تعمل على زيادة الوزن.'),
  MyModel(
      content:
          '●	يوجد في هذه المرحلة زيادة كبيرة في معدل التمثيل العضوي وتدفق الدم؛ ولهذا آثار إيجابية على نمو الأظافر، فتنمو بشكل كبير، ولكنها للأسف لها تأثير سلبي على اللثة حيث تكون أكثر عرضة للالتهابات والنزيف. ●	عند النوم تتحول أحلامك إلى مشاهد مثيرة وممتعة، وقد أثبتت هذا العديد من الأبحاث والدراسات المتخصصة. ●	يزاد حجم الثدي في هذه الفترة بشكل ملحوظ. ●	يزيد وزن النساء في الحمل حوالى من 10 إلى 12 كيلو، وليس هذا هو الوقت المناسب لاتباع نظام غذائي معين، أو محاولة التنحيف والرشاقة.'),
  MyModel(
      content:
          'قد تشعرين بحركة الطفل - دائما ما يكون شعورك ببداية حركة الجنين في الحمل الأول عند الأسبوع 18-20. - ويسبب نمو الطفل في هذه المرحلة الضغط على المعدة وهو ما يؤدى إلى ارتخاء العضلة العاصرة أعلى المعدة وأعلى الجسم عامة مما يسمح برجوع الطعام إلى المريء ويسبب مشكلة الحرقان التي يعاني منها جميع الحوامل. - ولابد في هذه المرحلة أن تطمئني على حالة جنينك من حيث حجمه وشكله غريب أم شاذ أم طبيعي والتأكد من أن حجم الرأس طبيعي وأطراف وأعضاء الجنين سليمة وطبيعية ويكون ذلك عن طريق عمل الأشعة التليفزيونية على يد طبيبك المتابع لك ولكي يتأكد أيضا من سلامة كل شيء داخل الرحم. - بالنسبة لثدييك تلاحظي نزول لباء الحمل منه وهذا هو ما يكون قبل الحليب كما أن طفلك يتغذى عليه أول ثلاثة أيام بعد الولادة. - ومن الطبيعي أن تلاحظي نزول الكثير من الإفرازات المهبلية أثناء الحمل فلا تقلقي.'),
  MyModel(
      content:
          'الأسبوع 21 من الحمل الدخول في هذا الأسبوع من الحمل، يعني بدء المرحلة الثانية من الحمل، وأبرز علامات هذه المرحلة زيادة الوزن، ستلاحظين زيادة وزنك أسبوعيا بمعدل نصف كيلو جرام، يفضل عدم الإكثار من تناول الأطعمة خلال هذه الفترة اعتقادا في العبارة السائدة بتناول الطعام لشخصين، وهذا الأمر غير صحيح على الإطلاق. ولهذا ينصح السيدات الحوامل بعدم الإكثار من تناول الطعام لتجنب ظهور الكثير من المشكلات خاصة في الشهور الأخيرة من الحمل، وأبرزها مشكلة ألم الساقين وغيرها من المشكلات، أغلب السيدات الحوامل تزداد أوزانهم خلال فترة الحمل بمعدل من 4 إلى 6 كيلو جرام.'),
  MyModel(
      content:
          'الأسبوع 22 من الحمل أبرز علامات الحمل في هذا الأسبوع، خروج اللباء من الثديين، وهي مادة صفراء تخرج من ثديي المرأة الحامل، وهذه المادة المغذية للطفل طوال 3 أيام الأولي من الولادة والذي يطلق عليه اسم لبن السرسوب، تشعر المرأة الحامل بحلول هذا الأسبوع بأن الثديين أصبح حجمها أكبر من ذي قبل، ويكون ذلك مصاحبا بآلام في الثديين، نسلط الضوء في هذا المقال على أبرز تغييرات جسم الحامل خلال هذه الفترة.'),
  MyModel(
      content:
          'الأسبوع 23 من الحمل ، عادة ما يكون مصاحب بالكثير من التغيرات الهرمونية التي تتسبب في ظهور مشاكل العينين لدى السيدات الحوامل، وأغلب السيدات لا تتمكن من ارتداء العدسات اللاصقة لظهور العديد من المشكلات، ولهذا يفضل مراجعة الطبيب وإجراء الفحص الدقيق قبل تفاقم المشكلة، تابعوا معنا أهم التغييرات التي تطرأ على المرأة الحامل والجنين بحلول الأسبوع الثالث والعشرين من الحمل.'),
  MyModel(
      content:
          'الأسبوع 24 من الحمل ، تشعر المرأة الحامل بحلول هذا الأسبوع بالمزيد من الحيوية والطاقة، يزداد حجم بطنك ويزداد وزنك بشكل ملحوظ، ويمكنك التخلص من علامات التمدد التي تظهر على جسمك خلال فترة الحمل، بتدليك الجسم بالزيوت الطبيعية أو المرطبات، التي من شأنها التخفيف من ظهور هذه العلامات، وإليكم أبرز التغييرات التي تشعر بها المرأة الحامل بحلول هذا الأسبوع. أبرز ما يطرأ على جسم المرأة الحامل أبرز ما تشعر به المرأة الحامل خلال هذه الفترة هي الصعوبة الشديدة في التنفس، والسبب في ذلك الجهد الكبير الذي تبذله السيدة الحامل للتخلص من غازات الفضلات الناتجة من جسم الجنين.'),
  MyModel(
      content:
          "جسمك في الأسبوع الخامس والعشرين في الحمل في هذه الفترة قد تشعرين بألم يصيب ظهرك، حيث أن وزنك سوف يزداد تقريبًا ستة كيلو جرامات ويتسع الرحم ليصبح بحجم كرة القدم، وهذا يؤدي بطبيعة الحال إلى آلام بالظهر وإصابة الساقين بالتشنج، كما يؤدي إلى الضغط على حوض الأم. سوف تتأثر عملية التنفس وذلك بسبب تأثير الرحم على عملية تمدد القفص الصدري بشكل كامل، وهوما يؤدي إلى ضيق في التنفس. سوف تجدين أن قدميك ويديك أصيبوا بالانتفاخ وذلك بسبب احتباس البول، وفي هذه الحالة عليك بمراجعة الطبيب لأنها إشارة طليعة الارتجاع. 70% من النساء الحوامل يتغير لون جلد الوجه إلى اللون الداكن بسبب ارتفاع نسبة هرمون الاستروجين الأنثوي."),
  MyModel(
      content:
          "الأسبوع 26 من الحمل من أهم المراحل التي تتطلب الاسترخاء والراحة، يستلزم الراحة على قدر الإمكان خلال هذه الفترة وتجنب إجهاد النفس لعدم الأضرار بصحة جنينك، تابعوا معنا السطور التالية لمعرفة كيف يكون طفلك خلال هذه الفترة من الحمل. نصائح وإرشادات هامة •	الراحة التامة والاسترخاء وتجنب الإرهاق والإجهاد. •	تشعر كثير من السيدات الحوامل بالشد في الخصر والثديين، ويمكنك التغلب على هذا الشعور المؤلم باستخدام الكريمات المرطبة، هذه الكريمات الموضعية من شأنها التخفيف من الشعور بالشد بمنطقتي الثديين و الخصر."),
  MyModel(
      content:
          "بطنك وقد ازداد حجما - تشعرين بالكثير من الألم في هذا الأسبوع بسبب تواصل ضغط الرحم على القفص الصدري مما يؤدي إلى أن الأضلاع السفلية تتوزع  وتسبب الكثير من الألم. - كما أن وزنك يزداد من 5 إلى 5,5 كيلو غرام - لكي تتجنبي الكثير من الألم الظهر عند الجلوس ضعي وسادات خلفك عن الجلوس وخاصة في الأسفل."),
  MyModel(
      content:
          "يزداد شعورك بركلات طفلك والتي تكون متتالية، ويتغير شكل السرة لتصبح منبسطة وبارزة إلى الخارج، والتي تعود إلى طبيعتها بعد الولادة. ويزداد حجم البطن لتصبح مناسبة مع حجم الطفل والذي يركل كثيرا ويهتز خاصة في فترة الليل وبالتالي تقل راحتك أثناء فترة النوم. ونظرا لزيادة حجم الجنين وحركته المستمرة التي تضغط على المثانة تكوني في حاجة شديدة إلى دخول الحمام كثيرا وباستمرار كما يجب الأكثار من شرب المياه لتفادي حدوث عدوى. ومن هنا تبدأي في التخطيط للمرحلة المقبلة وهي مرحلة الولادة. نصائح وإرشادات ننصح الأم التي تشعر بآلم في الساقين وثقل عليهما أن تتمدد على الأرضية وتقوم برفع الساقين في مواجهة الحائط وتظل لمدة من 10 إلى 15 دقيقة على هذا الوضع. كما ننصح بتناول الأطعمة المفيدة والغنية بالفيتامينات كالحديد مثل اللحوم والحبوب والخبز الاسمر وأيضا السبانخ."),
  MyModel(
      content:
          "المزيد من الفحوصات - هذه هي مرحلة المنتصف التي يكون فيها الرحم بين السره والأضلاع كما انه يبدأ في الميل نحو الأمام. - ويجب تقومي بعمل فحوصات شاملة وللجنين في العيادات والمعامل المخصصة لذلك. - في هذا الفصل الثالث من الحمل يكون هناك الكثير من التعب والعبء على الأم ...فيجب الحرص على تناول الأطعمة التي تحتوي على نسبة حديد عالية حتى تقوى وتساعد أربطة البطن التي تمددت بسبب الحمل, كما أنه يجب على الحامل عمل تمارين خفيفة لتخفف من حدة الألم العضلات عليها ويكون ذلك بشكل يومي, ومن أنواع هذه التمارين القرفصاء فهو وضع يساعد في توسيع الحوض ويجعلك تستفيدين من الجاذبية الأرضية كما أن هذه التمارين تجعل الولادة أكثر سهولة بسبب توسيع الحوض."),
  MyModel(
      content:
          "الأسبوع 30 من الحمل هو أسبوع التقلبات والتغييرات، بمجرد الدخول في هذا الأسبوع ينتاب المرأة العامل العديد من التغييرات التي تشعرين معها بأنها حامل، والسبب في ذلك هو التغيرات الهرمونية والتي تؤثر بدورها على المزاج، تابعونا معنا المقال التالي لمعرفة أهم هذه التغييرات. تغييرات طارئة على جسمك خلال هذه الفترة ·         يزداد وزن الجسم، ويصبح البطن أكثر بروزا من ذي قبل. ·         يسبب زيادة حجم البطن في التأثير على الظهر، دائما ما يكون ذلك مصحوبا بآلام الظهر علاوة على صعوبة التنفس والتعب والإرهاق والأرق بشكل دائم. ·         لا تقلقي من زيادة الوزن، أغلب هذه الزيادة في الوزن ناتجة عن حجم الجنين والماء المحيط بالجنين، والمشيمة التي يبلغ حجمها 700 جرام تقريبا، علاوة على الدم والرحمة المتضخم والثديين، من السهل استعادة وزنك الطبيعي عقب الولادة."),
  MyModel(
      content:
          "•	جسمك: تتعرض الأم في هذه الفترة إلى حكة شديدة وتهيج في الجلد، والإفراط في هذه الحكة يتسبب في ضرر إلى الأم والجنين، ولهذا يجب عليكي الالتزام بمواعيد المتابعة مع الطبيب واستشارته بأمر هذه الحكة. حيث يؤدي تعرض مجرى البول للالتهابات إلى مشاكل تضر بالحمل ويمكن تجنب هذه المشاكل من خلال زيادة كميات السوائل والتي تعمل على طرد البكتيريا. حيث يكون حجم الرحم في هذه المرحلة كبير عن الطبيعي 500 مرة."),
  MyModel(
      content:
          "آلام وصداع متزايد - يستدل على اقتراب موعد الولادة من تزايد هرمون الحمل ريلاكسين وزيادة الوزن بشكل ملحوظ للطفل وتمدد عضلات الحوض بسبب حجم الطفل وبسبب اقتراب موعد الولادة. - ويحدث أحيانا بعض الألم في منطقة الحوض وتشعر بالصداع. - ويجب على الحامل تناول سعرات حرارية أكثر من السابق بسبب سوء الهضم الذي يسببه ضغط الرحم على المعدة مما يجعل الجسم لا يستفيد من الطعام. - وتعلم ممارسة التمارين الخاصة بالحوامل من مركز متخصص لذلك هو شيء في غاية الأهمية لتسهيل الولادة والتعرف على أشخاص جدد يغير من مزاج الأم الحامل ويزودها بالمعلومات الكثيرة منهم."),
  MyModel(
      content:
          "الأسبوع 33 من الحمل من أصعب الأسابيع التي تمر بها المرأة الحامل، والسبب في ذلك أنها لا تتمكن من النوم بشكل طبيعي بهذه الفترة، تواجه المرأة الحامل صعوبة في النوم نتيجة تغيير وضع الجنين داخل الرحم، يصبح رأس الجنين للأسفل، وهذا بدوره يؤدى إلى صعوبة شديدة في التنفس، نسلط الضوء في هذا المقال على التغيرات التي تطرأ على المرأة الحامل والجنين خلال الأسبوع الثالث والثلاثين من الحمل."),
  MyModel(
      content:
          "إذا كنتي إمرأة عاملة فعليكي أن تقللي من المجهود المبذول خلال هذه الفترة حتى إذا استطعتي تقليل ساعات العمل يكون أفضل. سوف تلاحظي اختلاف كبير في حجم الخصر، نظرا لأنه يتزايد في فترة الحمل بنسبة 27 بوصة إلى حوالي 42 بوصة ويجب في هذا الوقت من الحمل أن تتخذ السيدة الحامل اجازة من العمل لتسترخى وتستعد لمرحلة الولادة. قد تتعرضي لحكة في جلد البطن، نظرا لأنها تتمدد وبالتالي تحتاج إلى الرطوبة وينصح بتناول الأطعمة الغنية بفيتامين h وفيتامين a نظرا لأن هذه الفيتامينات لها فوائد كبيرة للجلد وأيضا يقوي من قلب ورئة الجنين."),
  MyModel(
      content:
          "جسمك أحاسيس من الترقب والخوف - من الطبيعي أن تشعر الحامل بالخوف والقلق وتشتيت الفكر كلما اقتراب التاريخ المحدد لولادتها. - ونتيجة هذا الشعور يكون هناك عدم رغبه واهتمام بالجماع والجنس. - ويستحسن في هذه الفترة أن تقوم الأم بتمارين خفيفة تناسب الحوامل وتتنازل الموز مع الزبيب لكي تكتسب طاقة أكثر وتستعيد كل ما تفقده أثناء الحمل من صحتها."),
  MyModel(
      content:
          "يصبح حجم البطن كبير وبالتالي يكون ثقيل على الأم ويجعلها تشعر بالتعب من أقل مجهود، وخاصة عند تناول الطعام، ولهذا يفضل تناول الشوربات وبعض قطع الفواكة التي تجعلها تشعر بالشبع. يقوم الطفل بحركة مستمرة والتي تتسبب في شعور الأم بآلام في الأضلاع والقفص الصدري لأن الرحم يضغط عليه. في حالة شعورك بسخونة في جسمك أو حرارة نتيجة الثقل ينصح بأخذ حمام مياه فاترة."),
  MyModel(
      content:
          "الأسبوع 37 من الحمل تبدأ المرأة الحامل في الشعور بانقباضات الرحم خلال هذا الأسبوع، ويطلق على هذه الانقباضات اسم براكستون هيكس، وهذه ليست الانقباضات المنتظرة للولادة، لا تنزعجي كثير من السيدات يشعرن بهذه الانقباضات، وهناك عدد من التمارين الواجب على كل امرأة حامل القيام بها من أجل ولادة سهلة، تعرفوا معنا خلال السطور التالية كيف يكون طفلك في الأسبوع السابع والثلاثين من الحمل. تغييرات في جسم الحامل تشعر أغلب السيدات الحوامل بالعديد من التغييرات بهذه الفترة وأبرزها ما يلي : •	الصعوبة في التنفس، أغلب السيدات الحوامل تعاني من هذه المشكلة، وهذا الأمر يسبب الازعاج الشديد، ويمكن التغلب عليه باتباع تمرين بسيط للغاية بإمكانك القيام به في المنزل، قومي بالجلوس على أربع، على القدمين واليدين، باعدي بين الركبتين، مع مراعاة وجود مسافة فاصلة بين الأرض وبطنك، وهذا التمرين يساعد على التنفس بشكل طبيعي."),
  MyModel(
      content:
          "الأسبوع 38 من الحمل خلاله تواجه المرأة الحامل العديد من الصعوبات، أصبح رأس الطفل ضاغطا على المثانة مما يجعلها تذهب إلى الحمام بشكل متكرر، أصبح الطفل كبير الحجم، وفي هذه المرحلة الام اكثر حساسية لحركات الجنين، ولهذا فهي دائمة الشعور بركلات اليدين والقدمين، وللمزيد تابعوا معنا السطور التالية. أبرز تغييرات جسم الحامل في هذا الاسبوع •	أصبحت الأم في هذا الأسبوع تتنفس بشكل طبيعي، وذلك لنزول الجنين ودخوله في منطقة الحوض، استعدادا لعملية الولادة. •	تعاني عدد من السيدات الحوامل من ضغط الدم المرتفع، وهذا يعني ظهور أعراض طليعة الارتعاج، وهنا تأتي الخطورة على الجنين، فهذه الحالة تعيق وصول الأكسجين إلى الجنين مما يشكل خطورة كبيرة على حياة الجنين، كما تعيق هذه الحالة عملية الأكل. •	لا تتمكن كثير من السيدات خلال هذه الفترة من النوم بشكل طبيعي، بالرغم من أنها تتخذ الوضعية الصحيحة للنوم، ولهذا يفضل الاستحمام بماء دافئ قبل الخلود إلى النوم فهذا يساعد على الاسترخاء، كما يمكنك وضع وسادة بين الركبتين لمزيد من الاسترخاء وزيادة القدرة على النوم."),
  MyModel(
      content:
          "الأسبوع 39 من الحمل بالدخول إلى هذا الاسبوع نكون قد اقتربنا من الحدث وهو موعد الولادة، تشعر المرأة الحامل خلال هذه الفترة بالتعب والإرهاق وعدم القدرة على التحرك والقيام بالمهام اليومية بشكل طبيعي، تابعوا معنا المقال التالى لمعرفة أبرز التغييرات التي تطرأ على المرأة الحامل والجنين في هذا الأسبوع من الحمل. تغييرات جسمك في هذه الفترة تتعرض بعض السيدات إلى العديد من العلامات التي تجعلها تظن أنه موعد الولادة، وذلك بسبب الإصابة بتقلصات البراكستون هيكس، ولكن كيف تفرق المرأة الحامل بين هذه التقلصات والمخاض، وإليكم أبرز العلامات، وهي على النحو التالى: •	عادة ما يصاحب تقلصات الولادة عدم القدرة على الحركة. •	تقلصات المخاض متتابعة ومنتظمة، تشعر بها المرأة الحامل كل 5 أو 10 دقائق. إذا شعرتي سيدتي بهذه الأعراض فأنت الآن في حالة المخاض."),
  MyModel(
      content:
          "الأسبوع 40 من الحمل هو الأسبوع الأخير في الحمل، تستعد الأم في هذا الأسبوع إلى استقبال جنينها، يبدأ المخاض ونزول الماء في أى لحظة، ويتبعها حدوث انقباضات غير منتظمة فى الرحم، كلما شعرتي بالتعب والارهاق في المخاض،  تأكدي أن طفلك هو الآخر يشعر بما تشعرين به تماما، تابعوا معنا السطور التالية لمعرفة كيف يكون وضع الطفل في الشهر الأخير من الحمل. أبرز تغيرات جسم المرأة الحامل •	انتفاخ البطن بشكل كبير. •	الرغبة في تناول الحلويات مثل الشيكولاته، فهي من الأغذية المفيدة فهي تمنح الجسم الحديد وكذلك الكالسيوم. •	الشعور بانقباضات الرحم، استعدادا للولادة.")
];
